{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"Dense","config":{"units":100,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true,"batch_input_shape":[null,1],"dtype":"float32"}},{"class_name":"Reshape","config":{"target_shape":[10,10],"name":"reshape_Reshape1","trainable":true}},{"class_name":"RNN","config":{"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"cell":{"class_name":"StackedRNNCells","config":{"cells":[{"class_name":"LSTMCell","config":{"units":20,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"name":"lstm_cell_LSTMCell1","trainable":true}},{"class_name":"LSTMCell","config":{"units":20,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"name":"lstm_cell_LSTMCell2","trainable":true}},{"class_name":"LSTMCell","config":{"units":20,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"name":"lstm_cell_LSTMCell3","trainable":true}},{"class_name":"LSTMCell","config":{"units":20,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"name":"lstm_cell_LSTMCell4","trainable":true}},{"class_name":"LSTMCell","config":{"units":20,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"name":"lstm_cell_LSTMCell5","trainable":true}},{"class_name":"LSTMCell","config":{"units":20,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"name":"lstm_cell_LSTMCell6","trainable":true}},{"class_name":"LSTMCell","config":{"units":20,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"name":"lstm_cell_LSTMCell7","trainable":true}},{"class_name":"LSTMCell","config":{"units":20,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"name":"lstm_cell_LSTMCell8","trainable":true}},{"class_name":"LSTMCell","config":{"units":20,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"name":"lstm_cell_LSTMCell9","trainable":true}},{"class_name":"LSTMCell","config":{"units":20,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"name":"lstm_cell_LSTMCell10","trainable":true}},{"class_name":"LSTMCell","config":{"units":20,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"name":"lstm_cell_LSTMCell11","trainable":true}},{"class_name":"LSTMCell","config":{"units":20,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"name":"lstm_cell_LSTMCell12","trainable":true}},{"class_name":"LSTMCell","config":{"units":20,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"name":"lstm_cell_LSTMCell13","trainable":true}},{"class_name":"LSTMCell","config":{"units":20,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"name":"lstm_cell_LSTMCell14","trainable":true}},{"class_name":"LSTMCell","config":{"units":20,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"name":"lstm_cell_LSTMCell15","trainable":true}},{"class_name":"LSTMCell","config":{"units":20,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"name":"lstm_cell_LSTMCell16","trainable":true}},{"class_name":"LSTMCell","config":{"units":20,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"name":"lstm_cell_LSTMCell17","trainable":true}},{"class_name":"LSTMCell","config":{"units":20,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"name":"lstm_cell_LSTMCell18","trainable":true}},{"class_name":"LSTMCell","config":{"units":20,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"name":"lstm_cell_LSTMCell19","trainable":true}},{"class_name":"LSTMCell","config":{"units":20,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"name":"lstm_cell_LSTMCell20","trainable":true}}],"name":"stacked_rnn_cells_StackedRNNCells1","trainable":true}},"name":"rnn_RNN1","trainable":true,"batch_input_shape":[null,10,10],"dtype":"float32"}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true,"batch_input_shape":[null,20],"dtype":"float32"}}]},"keras_version":"tfjs-layers 2.3.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1/kernel","shape":[1,100],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[100],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_0/kernel","shape":[10,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_0/recurrent_kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_0/bias","shape":[80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_1/kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_1/recurrent_kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_1/bias","shape":[80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_2/kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_2/recurrent_kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_2/bias","shape":[80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_3/kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_3/recurrent_kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_3/bias","shape":[80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_4/kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_4/recurrent_kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_4/bias","shape":[80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_5/kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_5/recurrent_kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_5/bias","shape":[80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_6/kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_6/recurrent_kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_6/bias","shape":[80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_7/kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_7/recurrent_kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_7/bias","shape":[80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_8/kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_8/recurrent_kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_8/bias","shape":[80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_9/kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_9/recurrent_kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_9/bias","shape":[80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_10/kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_10/recurrent_kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_10/bias","shape":[80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_11/kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_11/recurrent_kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_11/bias","shape":[80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_12/kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_12/recurrent_kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_12/bias","shape":[80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_13/kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_13/recurrent_kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_13/bias","shape":[80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_14/kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_14/recurrent_kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_14/bias","shape":[80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_15/kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_15/recurrent_kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_15/bias","shape":[80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_16/kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_16/recurrent_kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_16/bias","shape":[80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_17/kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_17/recurrent_kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_17/bias","shape":[80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_18/kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_18/recurrent_kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_18/bias","shape":[80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_19/kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_19/recurrent_kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_19/bias","shape":[80],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[20,1],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.3.0","convertedBy":null}